 gcc -g p1final.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x822: file p1final.c, line 16.
(gdb) r
Starting program: /home/runner/IA2-Test1-Session2-3/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1final.c:16
16  {
(gdb) n
18      input(&base,&height);
(gdb) s
input (base=0x7ffecc31de2c, height=0x7ffecc31de30) at p1final.c:4
4       printf("enter the base and height of the triangle\n");
(gdb) n
enter the base and height of the triangle
5       scanf("%f%f",base,height);
(gdb) n
1
2
6   }
(gdb) n
main () at p1final.c:19
19      find_area(base,height,&area);
(gdb) s
find_area (base=1, height=2, area=0x7ffecc31de34) at p1final.c:9
9       *area=0.5*base*height;
(gdb) p base
$1 = 1
(gdb) p height
$2 = 2
(gdb) n
10  }
(gdb) n
main () at p1final.c:20
20      output(base,height,area);
(gdb) s
output (base=1, height=2, area=1) at p1final.c:13
13      printf("area of triangle with %f base and %f height is %f\n",base,height,area);
(gdb) n
area of triangle with 1.000000 base and 2.000000 height is 1.000000
14  }
(gdb) n
main () at p1final.c:21
21      return 0;